DataReader 함수 -> 웹 상의 데이터를 DataFrame 객체로 만드는 기능

In [ ]:
import pandas_datareader

In [2]:
pandas_datareader

In [3]:
import pandas_datareader.data as web

In [4]:
web

In [5]:
import datetime

In [6]:
start = datetime.datetime(2016, 2, 19)
end = datetime.datetime(2016, 3, 4)

In [7]:
print(start, end)

2016-02-19 00:00:00 2016-03-04 00:00:00

In [13]:
# DataReader 함수를 이용해 데이터 조회하기
# 종목 번호와 데이터를 가져올 소스(야후)를 입력

gs = web.DataReader("078930.KS", "yahoo", start, end)

In [14]:
gs

             High    Low   Open  Close  Volume     Adj Close
Date
2016-02-19  51100  49950  50300  50600  301800  42082.011719
2016-02-22  50800  49850  50300  50400  153961  41915.683594
2016-02-23  53000  50800  50800  52800  431934  43911.664062
2016-02-24  53500  51900  52000  53500  259616  44493.824219
2016-02-25  54700  52700  53900  53900  170839  44826.488281
2016-02-26  54500  53200  54300  53300  159453  44327.496094
2016-02-29  53900  52800  53000  53000  154692  44077.996094
2016-03-02  55200  53500  53900  55100  229999  45824.488281
2016-03-03  55800  54300  55300  55000  217063  45741.312500
2016-03-04  54800  53200  54700  54200  237934  45075.992188

In [17]:
"""
추신: 네이버도 가능하다
공식 문서 링크: 
https://pandas-datareader.readthedocs.io/en/latest/remote_data.html#remote-data-naver
"""
stock = web.DataReader("000660", "naver", start, end)

In [18]:
stock

             Open   High    Low  Close   Volume
Date
2016-02-19  29950  30050  29250  29600  2336536
2016-02-22  29400  30000  29400  29900  1366180
2016-02-23  30100  30600  30000  30400  2123648
2016-02-24  31050  31250  30600  30900  3480563
2016-02-25  31400  31500  30650  30800  2527297
2016-02-26  31000  31100  30450  30800  1282277
2016-02-29  30800  30900  29600  30000  2989861
2016-03-02  31050  31300  30650  30950  3567312
2016-03-03  31550  32000  31100  31950  3898363
2016-03-04  31800  32100  31550  31900  1913316